---
kind: method
id: M:Autodesk.Revit.DB.Electrical.VoltageTypeSet.Erase(Autodesk.Revit.DB.Electrical.VoltageType)
source: html/e2ec696b-fa41-ea72-08cb-4d64e40dacab.htm
---
# Autodesk.Revit.DB.Electrical.VoltageTypeSet.Erase Method

Removes a specified voltage type from the set.

## Syntax (C#)
```csharp
public virtual int Erase(
	VoltageType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.VoltageType`) - The voltage type to be erased.

## Returns
The number of voltage types that were erased from the set.